# YOLOv5 ?? by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 3
 # - [10,13, 16,30, 33,23]  # P3/8
 # - [30,61, 62,45, 59,119]  # P4/16
 # - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone   backbone固定 不需要进行额外的trciks
backbone:
  # [from, number, module, args]
  [[ -1, 1, Focus, [ 64, 3 ] ],  # 0-P1/2
   [ -1, 1, Conv, [ 128, 3, 1 ] ],  # 1
   [ -1, 1, space_to_depth, [ 1 ] ],   # 2 -P2/4
   [ -1, 3, C3, [ 128 ] ],          # 3
   [ -1, 1, Conv, [ 256, 3, 1 ] ],  # 4
   [ -1, 1, space_to_depth, [ 1 ] ],   # 5 -P3/8
   [ -1, 6, C3, [ 256 ] ],          # 6
   [ -1, 1, Conv, [ 512, 3, 1 ] ],  # 7-P4/16
   [ -1, 1, space_to_depth, [ 1 ] ],   # 8 -P4/16
   [ -1, 9, C3, [ 512 ] ],          # 9
   [ -1, 1, Conv, [ 1024, 3, 1 ] ], # 10-P5/32
   [ -1, 1, space_to_depth, [ 1 ] ],   # 11 -P5/32
   [ -1, 3, C3, [ 1024 ] ],         # 12
   [ -1, 1, CA, [ 1024 ] ],       # 13
   [ -1, 1, SPPF, [ 1024, 5 ] ],  # 14
  ]


# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 16
   [[-1, 9], 1, AdConcat2, [1]],  # 17 cat backbone P4
   [-1, 3, C3, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]],  # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 20
   [[-1, 6], 1, AdConcat2, [1]],  # 21 cat backbone P3
   [-1, 2, C3HB, [256]],  # 22 (P3/8-small)

   [-1, 1, Conv, [256, 3, 1]],  # 23
   [-1, 1, space_to_depth, [1]],  # 24 -P2/4
   [[-1, 19, 9], 1, AdConcat3, [1]],  # 25 cat head P4
   [-1, 2, C3HB, [512]],  # 26 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 1]],  # 27
   [-1, 1, space_to_depth, [1]],       # 28 -P2/4
   [[-1, 15], 1, AdConcat2, [1]],  # 29 cat head P5
   [-1, 2, C3HB, [1024]],  # 30 (P5/32-large)

   [[22, 26, 30], 1, Detect, [nc, anchors]],  # 31 Detect(P3, P4, P5)
  ]
